[
  {
    "name": "Camilo Montoya",
    "twitter": "@camilomontoyau",
    "talks": [
      {
        "title": "[Workshop] Git Azanzado",
        "description": "Vamos a aprender a usar git rebase, git rebase interactive y git bisect para resolver problemas cotidianos como correcciones a los commits o no perder código haciendo merges sin respetar la línea de tiempo de los desarrollos que están en las ramas principales antes que los nuestros",
        "track": 1,
        "multiTracks": 2,
        "time": "09:00:00"
      }
    ]
  },

  {
    "name": "Sorey Garcia",
    "twitter": "@soreygarcia",
    "talks": [
      {
        "title": "Lilypad: IoT for inspiration",
        "description": "En esta charla quisiera compartir los proyectos de IoT que viene trabajando la comunidad Avanet para inspirar a las nuevas generaciones, mostrando algunos demos basicos que desde lo simple y lo cotidiano, pueden crear en ellos el deseo de convertirse en creadores de tecnología.",
        "track": 1,
        "time": "10:10:00"
      }
    ]
  },
  {
    "name": "Jhon Freddy Puentes Núñez",
    "twitter": "@jfreddypuentes",
    "talks": [
      {
        "title": "Machine Learning Para Todos",
        "description": "El Aprendizaje Automático se ha convertido en un area casi onmipresente en nuestras vidas. Está en el video juegos, en los mapas que usamos, en las recomendaciones que nos hace Youtube o Netflix. Pero, Cómo podemos hacer todo esto? Cómo puedo crear mi propia predicció?. Llegó la hora de aprenderlo!!",
        "track": 2,
        "time": "10:10:00"
      }
    ]
  },
  {
    "name": "Carlos Eduardo Acevedo Duque",
    "twitter": "@AcevedoAc",
    "talks": [
      {
        "title": "Acelerando la adopción DevOps usando 'Jenkins Templates'",
        "description": "Jenkins Templates es una alternativa con la que podremos acelerar la construcción de los workflows de IC, DC y EC, facilitando la estandarización y mantenimiento; permitiendo que tengas Pipelines as Code sin tener que entrenar a todas las personas en la nueva sintaxis.",
        "track": 1,
        "time": "10:50:00"
      }
    ]
  },
  {
    "name": "Douglas Urrea Ocampo",
    "twitter": "@douglasfugazi",
    "talks": [
      {
        "title": "Moving from Manual to Automated Tests with Cypress",
        "description": "La automatización de pruebas plantea sus propios desafíos diferentes de las pruebas manuales. No importa si eres un tester manual, las pruebas automatizadas con Cypress es una excelente manera de apoyar fácilmente las pruebas end-to-end en un equipo multifuncional.",
        "track": 2,
        "time": "10:50:00"
      }
    ]
  },
  {
    "name": "Raúl Andrés Alzate Gómez",
    "twitter": "@2a_raul",
    "talks": [
      {
        "title": "Conozcamos los principios de arquitectura",
        "description": "Como arquitecto, puede inspeccionar, quejarse y desarmar el diseño fácilmente. Sin embargo, si no tiene cuidado, puede dejar al equipo desconcertado y sin saber qué es lo correcto. Teniendo una lista de principios, los arquitectos dan su opinión conducido a los principios.",
        "track": 1,
        "time": "11:30:00"
      }
    ]
  },
  {
    "name": "María Dorancy Pemberthy",
    "twitter": "@MariaDPemberthy",
    "talks": [
      {
        "title": "Cómo gestionar mejor el tiempo",
        "description": "Definir prioridades entre la cantidad de tareas y labores personales, identificar fugaz de tiempo y como a través de pequeños hábitos se puede crear una disciplina más efectiva entorno a nuestras actividades.",
        "track": 2,
        "time": "11:30:00"
      }
    ]
  },
  {
    "name": "Raúl Andrés Alzate Gómez",
    "twitter": "@2a_raul",
    "talks": [
      {
        "title": "Conozcamos los principios de arquitectura",
        "description": "Como arquitecto, puede inspeccionar, quejarse y desarmar el diseño fácilmente. Sin embargo, si no tiene cuidado, puede dejar al equipo desconcertado y sin saber qué es lo correcto. Teniendo una lista de principios, los arquitectos dan su opinión conducido a los principios.",
        "track": 1,
        "time": "10:10:00"
      }
    ]
  },
  {
    "name": "Maria Dorancy",
    "twitter": "@MariaDPemberthy",
    "talks": [
      {
        "title": "Cómo gestionar mejor el tiempo",
        "description": "Definir prioridades entre la cantidad de tareas y labores personales, identificar fugaz de tiempo y como a través de pequeños hábitos se puede crear una disciplina más efectiva entorno a nuestras actividades.",
        "track": 2,
        "time": "10:10:00"
      }
    ]
  },

  {
    "name": "Hillmer Ch.",
    "twitter": "@HillmerCh",
    "talks": [
      {
        "title": "Cómo fracasar como desarrollador de software sin morir en el intento. Alerta de Troll.",
        "description": "Un Troll con sus no-consejos nos quiere mostrar que hacer (o no hacer) si queremos fracasar en el desarrollo de software. En esta sesión revisaremos sus planteamientos para darle una vuelta a su discurso y poder aprovecharlo para seguir creciendo como desarrolladores.",
        "track": 1,
        "time": "13:00:00"
      }
    ]
  },
  {
    "name": "Miguel Teheran",
    "twitter": "@Mteheran",
    "talks": [
      {
        "title": "Microfront-end que es y como implementarlo",
        "description": "Micro-frontend que es? como se usa? se relaciona con microservicios?. Analizaremos este tipo de arquitectura que cada vez cobra mas fuerza y el por que utilizarla en diferentes contextos o tipos de proyectos así como también la importancia que tiene en la migración de productos legacy.",
        "track": 2,
        "time": "13:00:00"
      }
    ]
  },
  {
    "name": "Kelly Hécate Villa",
    "twitter": "@02_KellyV",
    "talks": [
      {
        "title": "Seguridad IoT: Vulnerabilidades en dispositivos inteligentes para el hogar",
        "description": "Actualmente la necesidad de tele-operación en los hogares ha generado un crecimiento global de tecnologías IoT. Un porcentaje considerable de estos dispositivos se generan con media, poca o baja gestión de seguridad informática minimizando así la protección de datos del usuario final.",
        "track": 1,
        "time": "13:30:00"
      }
    ]
  },
  {
    "name": "Alejandro Agudelo",
    "twitter": "",
    "talks": [
      {
        "title": "Discovering swift package manager",
        "description": "Cualquier proyecto serio en swift debería usar un gestor de dependencias. Una opción bastante interesante es swift package manager que viene integrado en Xcode 11 y ayuda a los desarrolladores a crear aplicaciones mantenible. ¿Mucha información? En realidad no, ¡en solo 25 minutos te daré todo lo que necesitas para comenzar!",
        "track": 2,
        "time": "13:30:00"
      }
    ]
  },
  {
    "name": "Carlos Daniel Sanchez",
    "twitter": "@EruJazz",
    "talks": [
      {
        "title": "Programación Funcional en el Sistema de Gestión de la Malla Vial de Medellín",
        "description": "Conocerás de primera mano cómo durante la actualización del SGVial realizada en 2018, integramos Vavr (una librería de FP para Java) en Play Framework, usando además ReactJS y Docker, para impactar positivamente a los funcionarios públicos en su día a día brindándoles un sistema muy robusto.",
        "track": 1,
        "time": "14:00:00"
      }
    ]
  },
  {
    "name": "Oscar Andres Granada Baquro",
    "twitter": "@ogranada",
    "talks": [
      {
        "title": "Rust para quienes usan lenguajes de alto nivel",
        "description": "Aceptémoslo, el mundo está cambiando, y aunque muchos siguen con ganas de saber más de JavaScript, Python y otros lenguajes de alto nivel hay algo que dice, no olvides qué hay bases como el clásico lenguaje C++. Esta charla es una guía de inicio para Rust, mostrando por que es el nuevo C++.",
        "track": 2,
        "time": "14:00:00"
      }
    ]
  },
  {
    "name": "Jose Gaviria",
    "twitter": "@jfgaviria",
    "talks": [
      {
        "title": "Blockchain, Rutanio y la Tokeneconomia",
        "description": "En esta charla exploraremos los principios de Blockchain y la Tokeneconomía. Además ilustraremos con el caso de Rutanio, primer proyecto blockchain de opensource que define una Economía Mínima Viable para la ciudad de Medellín y las oportunidades que genera para desarrolladores, emprendedores y público general.",
        "track": 1,
        "time": "14:30:00"
      }
    ]
  },
  {
    "name": "Carlos Daniel Muñoz",
    "twitter": "@cdmunozi",
    "talks": [
      {
        "title": "Cómo migrar efectivamente a Kotlin una app Android",
        "description": "Recursos acerca de cómo empezar a trabajar con Kotlin hoy día, hay muchos: videos, tutoriales, blogs, codelabs, etc. Así, para aprender Kotlin como lenguaje nunca faltarán fuentes de información para entender el lenguaje y sus poderes. Pero al momento de pararse frente a un proyecto que tiene un codebase en otro lenguaje y empezar a migrarlo o integrarlo a Kotlin, no es tan simple, pues contextualizar el poder de Kotlin y aplicarlo efectivamente requiere de práctica para poder escribir adecuadamente el código",
        "track": 2,
        "time": "14:30:00"
      }
    ]
  }
]
